[
    {
        "additional_info": "Connecticut Collaborative The To ImproveAutism Services Resource Directory About Us This guide is published as part of the Connecticut Collaborative to Improve Autism Services ef- fort. The proposed benefit of this collaborative is to enhance Connecticut’s existing infrastructure supporting children and youth with autism spectrum disorder (ASD) and other developmental disabilities (DDs). This will be achieved through by providing both training and support to fami- lies, professionals and the public. The sponsors of this project are the Connecticut Department of Public Health’s Children and Youth with Special Health Care Needs Program and the A.J. Pappanikou Center for Excel- lence in Developmental Disabilities Education, Research and Services. The CT Department of Public Health (DPH) is dedicated to improving the community-based system of care for children and youth with special health care needs by ensuring their connection to a medical home that is accessible, compassionate, comprehensive, coordinated, continuous, culturally effective and family-centered. Children & Youth with Special Health Care Needs (CYSHCN) are those who have or are at increased risk for a chronic physical, developmental, behavioral or emotional condition and require health and related services beyond that required for children in general. DPH is fully committed to improving access to comprehensive, coordi- nated health care and related services for Connecticut children and youth with Autism Spectrum Disorders and Developmental Disabilities The A.J. Pappanikou Center is one of a national network of University Centers for Excellence in Developmental Disabilities Education, Research and Service (UCEDD) authorized by the federal Developmental Disabilities Assistance and Bill of Rights Act and funded through the Ad- ministration on Developmental Disabilities. We are a premier Center in the northeast for in- novative teaching, research, and technical assistance enhancing the quality of services and support for people with developmental disabilities and their families. Our activities are guided by a belief in individualized supports, inclusion, self-determination, natural supports and collaboration with organizations to address policy issues and systems change. AUTISM SERVICES: RESOURCE DIRECTORY | i Table of Contents Autism Services and Resources Connecticut (ASRC).........................................................................1 Charlotte Hungerford Hospital Center for Youth and Families The Connections Program for Children with ASD................................................................2 Child Development Infoline (CDI)...................................................................................................3 Birth To Three Referral Form................................................................................................5 Help Me Grow Referral Form...............................................................................................6 Connecticut Autism Action Coalition (CAAC)..................................................................................7 Connecticut Family Support Network (CTFSN)...............................................................................8 Connecticut Medical Home Initiative at FAVOR..............................................................................9 Connecticut Medical Home Initiative (CMHI)...................................................................10 Regional Town Listings........................................................................................................11 Eastern Region: United Community and Family Services, Inc.............................................12 North Central Region: Connecticut Medical Center - Special Kids Support........................13 Northwest Region: St. Mary’s Hospital................................................................................14 South Central Region: Family Centered Services of Connecticut, Inc..................................15 Southwest Region: Stamford Hospital..................................................................................16 FAVOR............................................................................................................................................17 FOCUS Center for Autism..............................................................................................................18 PATH Parent-to-Parent & Family Voices of Connecticut.................................................................19 Southern Connecticut State University (SCSU) Center of Excellence in Autism Spectrum Disorders............................................................20 Contacts...........................................................................................................................................21 AUTISM SERVICES: RESOURCE DIRECTORY | ii Autism Services and Resources Connecticut (ASRC) Key Services We provide information and referral for parents, families, caregivers and professionals working with people on the spectrum. We provide training and education for families, caregivers and other professionals and the general community. We provide training and social activities for persons on the spectrum. We create resources in the community: support groups, social groups, trained workforce providers, job creation, community activities. We advocate for persons on the spectrum and their families at the state and local level and the creation of resources in the community to serve our families. We provide community awareness and raise the level of un- derstanding about autism within the wider community. Eligibility Criteria There are no eligibility criteria for receiving services. Contact ADDRESS 101 North Plains Industrial Road, Harvest Park, Building 1A, Wallingford, CT 06492 PHONE 203.265.7717 WEBSITE www.ct-arsc.org AUTISM SERVICES: RESOURCE DIRECTORY | 1 Charlotte Hungerford Hospital Center for Youth and Families The Connections Program for Children with ASD Key Services Services provided to children and families with ASD includes a comprehensive assess- ment along with psychiatric evaluation (if clinically indicated). Assessment includes the use of the ASRS (Autism Spectrum Rating Scale). Mental health treatment in- cluding individual, family, and group therapy encompassing psycho-education on the diagnosis and treatment methods, psychotherapy, links, referrals, and collaboration with community resources and providers. New program initiatives include an autism multifamily parent group and a parent ASD support group. Eligibility Criteria Any child ages 3-18 is eligible for services at the clinic. No medical doctor referral is necessary. Children who are best suited for the program are those with moderate to mild Austim Spectrum Disorders and who have verbal skills. Assessment will be con- ducted for more severe children, however, treatment through the Connections Pro- gram may not be appropriate and other resources and referrals will be recommended for the family. Referral Process Parents/guardians interested in making a referral should contact The Center for Youth and Families at 860.489.3391 and request to make a referral to the “Connections Program.” All other mental health treatment referrals can be accessed by calling the same number listed above. Once linked to the triage secretary the referral process will begin. Intake appointments are offered within a 14 day period. Contact ADDRESS PHONE WEBSITE 1061 East Main Street, 860.489.3391 www.charlottehungerford.org Torrington, CT 06790 AUTISM SERVICES: RESOURCE DIRECTORY | 2 Child Development Infoline (CDI) Key Services CDI serves as the single point of entry into CT’s tion Kits, approved private special education pro- early intervention program, Birth to Three, as well grams, applications, etc. CDI trains pediatric prac- as serving as an access point for Early Childhood tices, utilizing the EPIC module, on developmental Special Ed, Children and Youth with Special Health surveillance, screening (including use of M-CHAT) Care Needs (CYSHCN) and Help Me Grow. We and making timely referrals for services. Families provide information, referrals and care coordina- can access information on autism services on the tion for families and connect them to support 2-1-1 website (www.211ct.org). CDI’s website services related to ASD. These include the Medical includes the developmental milestones related to Home Initiative sites, Family Support Network and development and autism. CT Medical Home Initiative at FAVOR. We con- nect families to autism specific services, advocacy, Eligibility Criteria diagnostics, trainings, support groups and websites There are no specific eligibility criteria for contact- as well. CDI assesses families’ needs and helps them ing CDI. We help families of children birth through think about additional services they may be eligible age 21 connect to services. There may be eligibility for, such as SSI, DDS, diapers, medical expense as- criteria realted to some of the services, however, CDI sistance, etc. We send out written materials related does the research to make sure the services families to ASD, such as the First 100 Days Kit, B-3 Autism are referred are appropriate and meet their needs. Guideline, Special Ed Advocacy Guidebook, Transi- Contact ADDRESS 1344 Silas Deane Hwy Rocky Hill, CT 06067 FAX 860.571.6853 TOLL FREE 800.505.7000 WEBSITE Main: www.ctunitedway.org/CDI.html 2-1-1: www.211ct.org Birth-to-Three: www.birth23.org See CDI referral forms on the following pages AUTISM SERVICES: RESOURCE DIRECTORY | 3"
    },
    {
        "additional_info": "Connecticut Autism Action Coalition (CAAC) Vision ences, proposals, financial resources, etc. at each A world in which Autism, is so clearly understood, meeting. that it is seen as a character trait not a disability, allowing the talents and strengths of an individual 2. All Active Members agree/vote annually on 2-3 with Autism Spectrum Disorders, to be identified, projects on which to focus the CAAC resource utilized and embraced by the community in which available through its members – time, financial, they live. facilities, equipment, etc. Achieving the Mission 3. Utilize Supportive Members effectively to assist • CAAC focuses on the outcome in projects where appropriate. • CAAC members model the behavior you want to see in the world 4. Agree to widely distribute information as request • Educate everyone you meet -ed by CAAC members, to your list serves, web- • Share the vision with everyone you know sites, or any other communication source. • Create opportunities for communities to perform the behaviors 5. Members may call upon the group for specific support requests (clearly detailed to avoid misunder- Mission standings) – attendance at events, phone calls, letter To provide one unified voice, supporting CT in the writing, etc. Requests must be specific and your abil- development and improvement of service access ity to participate should be communicated back to and quality for all individuals who are affected by the requestor. Autism Spectrum Disorders. 6. Members have the opportunity to opt out of any Implementing the Mission project or commitment that the CAAC makes as a 1. All Members will share all relevant information group.Our goal is to seek consensus on public posi- regarding Autism in CT - training, events, confer- tions and to advocate for them. Contact MEETING LOCATION PHONE FAVOR, Inc Doriana Vicedomini 185 Silas Deane Highway 860.668.5228 Wethersfield, CT 06109 504.259.4327 AUTISM SERVICES: RESOURCE DIRECTORY | 7 Connecticut Family Support Network (CTFSN) Key Services children of all ages and disabilities. The CTFSN exists to help families raising children with disabilities and special health care needs. For all Referrals the families we serve, services are free. Family sup- Families can request a connection through their port services include direct 1:1 support, informa- Birth to Three provider, DDS Case Manager, DDS tion about the child’s disability, a connection to state Helpline, or DPH Care Coordination contractors. and local resources, IFSP/PPT guidance, support CTFSN brochures and newsletters are available elec- groups, email distribution lists, training opportuni- tronically and in hard copy with broad distribution ties throughout the year, and an annual conference. The CTFSN has email distribution across CT reach- Additionally, CTFSN offers a valuable connection ing over 2,000 parents and professionals. Parents to a Parent Mentor who can share experiences, pro- who speak Spanish can connect directly to the CT- vide emotional support, critical resources and assis- FSN Bi-Lingual Coordinator, and parents speaking tance to learning to navigate the state systems, make other languages will be supported through through community connections and network with other Language Line. Then CTFSN sponsors leadership families. CTFSN has a diverse staff, including Bi- activities of the CT Chapter of Hands & Voices Lingual family support, advocacy specific to families which provides information and advocacy to fami- raising children who are deaf or hard of hearing and lies raising children who are deaf or hard of hearing. staff available in 6 regions across the state. The CTFSN has a partnership with Child Develop- ment Infoline where parents who want to connect Eligibility Criteria with other parents or need other information and Our services are free and open to families raising resources are offered a connection to the CTFSN. Contact PHONE 877.376.2329 SOCIAL MEDIA www.facebook.com/ctfsn WEBSITE www.ctfsn.org AUTISM SERVICES: RESOURCE DIRECTORY | 8 Connnecticut Medical Home Initiative at FAVOR Key Services meet their needs for funding of scripts, co- The Connecticut Medical Home Initiative at pays, equipment, formula and other services. FAVOR is a contractor responsible for process- Extended service funds are available to fami- ing all requests for Extend Service Funds and lies under 300% of the federal poverty level Respite Funding. Families are identified at out- with unmet needs. We pay at the Medicaid reach events attended around the state, work- rate, so those with Medicaid already have the shops, phone calls and word of mouth. Bilin- same benefit and thus are not eligible for these gual staff is available both on the phone, and funds, although they may still be eligible for re- for face to face meetings in our office. spite and care coordination. Those seeking re- spite funds are not eligible if they already have Eligibility Criteria a service from another source of greater value, Applications include a screener, to identify eli- since we are the payor of last resort. For fami- gible children, although referrals come from all lies not found eligible, we still look for dona- sorts of varied sources around the state. Com- tions, or other sources who can help them with pleted applications, once they have been en- their need. Respite funding is available until a tered in our database, are then copied on to child reaches the age of 21, while direct ser- the region in which the child resides for care vice funds end at the age of 18. We are always coordination. Applications can flow the other available to help families set up Direction Care direction; starting in one of the regions, with Notebooks in our office. We also have a parent them sending a copy on us to process and add lending library with books aimed at families, the family to the respite wait list, or to try and not medical text books. Contact ADDRESS FAX TOLL FREE 185 Silas Deane Highway, 860.563.3961 855.436.6544 Wethersfield, CT 06109 EMAIL PHONE ctmedicalhome@gmail.com 860.436.6544 AUTISM SERVICES: RESOURCE DIRECTORY | 9 AUTISM SERVICES: RESOURCE DIRECTORY | 10"
    },
    {
        "additional_info": "Connecticut Medical Home Initiative (CMHI), Eastern Region United Community and Family Services, Inc. Program Description The Eastern CT Medical Home Initiative offers care • Promote developmental screening coordination services to families in most towns in New London and Windham Counties. Care Coor- UCFS and Generations are full-service community dinators provide community-based, family-centered health centers providing adult and pediatric primary services. Their offices are located at United Commu- care, women’s health, dental services and a full range nity & Family Services, Inc. (UCFS) in Norwich, of behavioral health services including individual Jewett City and Plainfield and Generations Family and group counseling with therapists that specialize Health Center in Willimantic, Danielson and Put- in services for autistic children. HUSKY and most nam. There is no charge for care coordination ser- private insurances are accepted and there is a sliding vices. fee scale for the uninsured. Key Services Eligibility Criteria • Identification for CMHI services Medical Home Children age 0 - 21 must screen positive on the CT Screener and Complexity Index – repeated annu- Medical Home Initiative Screener and Complex- ally ity Index. There are no financial eligibility require- • Family Needs Assessment ments. • Coordination of Health Care and Related Services • Referral to Autism-Specific, Community-Based Resources for Educational Advocacy, Support Groups, Behavioral Health Counseling and Care Coordination, Medical & Dental Services, Respite Contact and Extended Service Funds, Health Care Advocacy, HUSKY Application Assistance, Basic Needs Servic- EMAIL medicalhome@ucfs.org es, DDS, DCF Voluntary Services, Cultural Support • Information about Workshops and Training FAX 860.822.4941 • Health Care System Navigation • Care Plan Development and Facilitation PHONE 860.822.4164 • Care Team Meeting Facilitation • Culturally Sensitive Bi-lingual care coordinators, TOLL FREE and Language Line for interpretation 1.866.923.8237 AUTISM SERVICES: RESOURCE DIRECTORY | 12 Connecticut Medical Home Initiative (CMHI), North Central Region Connecticut Children’s Medical Center Special Kids Support Center Key Services We provide culturally competent care coordination services to the North Central Region through our Medical Home Initiative Grant. The Special Kids Support Center provides educa- tional support to providers, families and other stakeholders throughout the State of Connecti cut. We offer Autism Spectrum Disorder EPIC (Educating Practice in the Community) train- ing to providers throughout the state and provide technical support as needed. Eligibility Criteria Children and youth with special care needs must meet the criteria for eligibility by scoring positive on the Connecticut Medical Home Initiative for CYSHCN Screener and Complexity Index Tool Children. Referrals Families/providers can contact us via the Special Kids Support Center main number or Inter- net. We can also be contacted through 211-Child Development Infoline, CT Medical Home Initiative at FAVOR, DPH and other referring organizations. Contact FAX 860.837.6201 PHONE 860.837.6200 TOLL-FREE 877.835.5768 AUTISM SERVICES: RESOURCE DIRECTORY | 13 Connecticut Medical Home Initiative (CMHI), Northwest Region St. Mary’s Hospital Key Services • A respectful working partnership with parents/youth/medical home • Interagency Collaboration • Educational/school planning • Social Services • Medical/Behavioral Assessment • Advocacy • Child/Family Specific Research • Transition • Care Plan Development • Linkages to Specialties, Services, Organizations • Assistance with applications/appeals for goods, services, supports, equipment, medication, respite service Eligibility Criteria Children and youth age 0-21 who have, or are at increased risk for, a chronic physical, developmental, behavioral or emotional condition and who also require health and related services of a type or amount beyond that required by children generally. Contact ADDRESS 95 Scovill St.,3rd Flo, Pavilion B, Waterbury, CT 06706 FAX 203.709.5153 PHONE 203.709.5716 See Child Development Infoline TOLL FREE 866.517.4388 AUTISM SERVICES: RESOURCE DIRECTORY | 14 Connecticut Medical Home Initiative (CMHI), South Central Region Family Centered Services of CT, Inc. New Haven Key Services We provide care coordination services, including and efficient use of current resources the following: • Monitoring outcomes for child, family, practice • Providing assessments and monitoring of child and other activities needed and/or requested by the and family needs. family. • Participating in parent/professional practice im- • Family support referrals (e.g. distribute training provement activities announcements via email, phone or in person) • Offering supportive on site and home base ser- • Facilitate interagency collaboration meeting on vices including counseling, education, and listening care coordination & transition from pediatric to • Facilitating communication among PCP, family, adult heath care, education to vocation and depen- and others dent living to independent living. • Developing, monitoring, updating, and following up with care planning and care plans Eligibility Criteria • Supporting meeting recommendations and fol- Children and youth age 0-21 who have, or are at in- low-up creased risk for, a chronic physical, developmental, • Coordinating inter-organizationally behavioral or emotional condition and who also re- • Advocating with and for the family quire health and related services of a type or amount • Finding, coordinating, and promoting effective beyond that required by children generally. Contact ADDRESS Family Centered Services of CT, Inc. New Haven, 235 Nicoll Street, New Haven, CT 06511 FAX 203.562.6232 PHONE 203.624.2600 AUTISM SERVICES: RESOURCE DIRECTORY | 15 Connecticut Medical Home Initiative (CMHI), Southwest Region Stamford Hospital Key Services Among the key services/activities that The Medical Home Initiative Southwest provides with regard to families and youth with ASD is a monthly support group for parents and caregivers of special needs children. The support group started in July of 2011 is held on the first Wednesday of each month. The group allows parents of special needs children to gather and share informa- tion and support for each other. Karleen Craddock from The Family Support Network often attends and provides flyers of local workshops and resources to the participants. We provide community resource and referral information to families and youth with ASD. Some of the resources that we connect families to are Birth To Three, DDS, Child Guidance, The Darien YMCA, The New Canaan YMCA, St. Vincent’s Behavioral Health Developmental and Autism Spectrum Disorder Services, The Kennedy Center Autism Project, CT. KASA, Abilis, The Pilot House, New Canaan Dance Academy, Healing Hearts, The Autism Society, Super Kids, The Montano Center, The Molly Ann Tango Foundation, The Umbrella Club, The Center For Children’s Advocacy, The Exchange Club, St. Joseph’s Parenting Center, and The Seed Center. Eligibility Criteria All patients with special health care needs ages 0-21 are welcome to receive services. Contact ADDRESS Shelburne Rd at West Broad Street, Stamford, CT 06902 PHONE 203.709.5716 TOLL FREE 866.239.3907 AUTISM SERVICES: RESOURCE DIRECTORY | 16 FAVOR, Inc Key Services FAVOR is a non-profit Statewide Family Advocacy Organization serving families, children and youth dealing with a broad spectrum of behavioral and mental health needs, by providing policy and family advocacy. FAVOR is committed to improving the quality of life for children, youth and families in Connecticut by increasing accessibility to effective, culturally competent and high quality family-driven mental and behavioral health services and supports. Through member organizations, FAVOR encourages family participation in policy development and the legislative process. FAVOR offers training, technical assistance and support to parents and caregivers in local communities to assist them in becoming active and equal partners in the System of Care. Eligibility Criteria There are no eligibility criteria other than we focus on non-system involved DCF families and children. Contact ADDRESS 185 Silas Deane Highway, Wethersfield, CT 06109 PHONE 860.436.6544 FAX NUMBER 860.563.3961 EMAIL ctmedicalhome@gmail.com WEBSITE www.favor-ct.org/advocacy.cfm AUTISM SERVICES: RESOURCE DIRECTORY | 17 FOCUS Center for Autism Key Services We provide children, adolescents and young adults with ASD’s reach their full potential by providing clinical programs, community education and family support. Our goal is for the children, adolescents and young adults we serve to be able to develop a greater sense of self- awareness, to learn to grow both socially and emotionally and to begin to understand who they are and how they “fit” into their world. Social learning is the backbone of all our programs and we do this through a unique treatment model called Milieu Therapy. Eligibility Criteria To be eligible for FOCUS, you must be between the ages of 5 and 18, be “creatively wired and socially challenged”, and not need a higher level of care. Our comprehensive intake process in- cludes a review of previous tests and evaluations, and an extensive intake interview that includes a mental status exam. Contact ADDRESS PO Box 452 126 Dowd Avenue, Canton, CT 06019 EMAIL info@focuscenterforautism.org FAX 860.693.0141 PHONE 860.693.8809 WEB www.focuscenterforautism.org AUTISM SERVICES: RESOURCE DIRECTORY | 18 PATH Parent-to-Parent & Family Voices of Connecticut Key Services PATH is a network of families providing informational and emotional support to others who have developmental or health related needs. Our Family Voices program aims to achieve family- centered care for all children and youth with special health care needs and/or disabilities. PATH and Family Voices provide one-to-one parent support with a “veteran parent” who has been through similar experiences and understands what the family is going through. PATH/FV also assists families with information about developmental an health related issues, information about healthcare, provide resources, resources on support groups, specialty doctors, therapy services, hairdressers to name a few. Some calls are associated with providing information on insurance coverage for all children and youth with special healthcare needs. Eligibility Criteria Yes, families need to have a child with special health care needs and we support families of chil- dren with all types of disabilities. Services are statewide and are provided at no cost for families. Contact LISTSERV CT-Fams@yahoogroups.com CTFVLeaders@yahoogroups.com FAX 203.234.1876 PHONE 203.234.9554 TOLL FREE 1.800.399.PATH (CT only) SOCIAL MEDIA www.facebook.com/pages/ PATH-Parent-to-Parent- Family-Voices-of-CT/ 170192649669163 WEBSITE www.pathct.org AUTISM SERVICES: RESOURCE DIRECTORY | 19 Southern Connecticut State University (SCSU) Center of Excellence on Autism Spectrum Disorders Key Services We are a resource center for teachers, school-based personnel, parents and community provid- ers serving individuals with ASD. The Center of Excellence on Autism Spectrum Disorders consists of three divisions: Training, Research, and Outreach. These divisions collaborate to provide professional development training opportunities, facilitate innovative research, assist in establishing effective evidence-based practices, and deliver technical assistance to teachers, other school based personnel, families and community service providers. Our goal is to improve student outcomes for individuals with ASD. Information regarding Center staff and current projects/initiatives may be found on our web- site. Questions regarding specific resources and supports may be directed to the Center staff by email or telephone as indicated below. Eligibility Critrea The Center of Excellence on Autism Spectrum Disorders does not have overall eligibility criteria for its offerings. The eligibility criteria are developed per activity and is communicated at the beginning of implementation of each activity through website announcements and email blasts of these announcements. Contact ADDRESS Davis Hall Southern Connecticut State University 501 Crescent Street New Haven, CT 06515 EMAIL Dr. Ruth Eren erenr1@southernct.edu PHONE 203.392.5929 WEBSITE www.southernct.edu/asd AUTISM SERVICES: RESOURCE DIRECTORY | 20 Contacts Key Points of contact for the Connecticut Collaborative to Improve Autism Services grant include: Mark Keenan, RN, MBA State Title V CYSHCN Director Connecticut Department of Public Health Ann Gionet, BBA Co-Coordinator Connecticut Department of Public Health Tierney Gianotti, MPA Co-Coordinator A.J. Pappanikou Center for Excelllence in Developmental Disabilities, Research, Education and Services Please visit the following websites to learn more about the grant, as well as autism resources available: Connecticut Collaborative to Improve Autism Services Connecticut Collaborative to Improve Autism Services @CTCollab4Autism Connecticut Deparment of Public Health: Children & Youth with Special Health Care Needs www.ct.gov/dph/cwp/view.asp?a=3138&q=499610 A.J. Pappanikou Center for Excellence in Developmental Disabilities Education, Research and Services www.uconnucedd.org/projects/autism_grant/index.html UConn UCEDD @CTCollab4Autism AUTISM SERVICES: RESOURCE DIRECTORY | 21"
    }
]