[
    {
        "tag": "p",
        "content": "I want to"
    },
    {
        "tag": "p",
        "content": "Autism Spectrum disorder (also called autism or ASD) is a lifelong neurodevelopmental condition characterized by difficulty with communication and social interaction, along with sensory challenges and/or repetitive behavior. The prevalence of autism has been rising, and currently occurs at a rate of 1 in 36. Autism starts before age 3, but sometimes symptoms are not noticed until a child is older."
    },
    {
        "tag": "p",
        "content": "There is wide variation in how people with autism function. Some have significant intellectual and communication disabilities and need support and assistance with daily activities. Others have advanced intellectual abilities and can live independently but often struggle with social skills and relationships. There are also many variations in between these two ends of the autism spectrum."
    },
    {
        "tag": "p",
        "content": "According to the CDC, there are many signs of autism.  Children need to have several of them in order to be given a diagnosis. Some of the more common symptoms are listed below:•    Unusual eye contact—avoidance or excessive•    Does not respond to name•    Does not point to show you things•    Does not share experiences or hold out objects to show them to you•    Does not play social games like peek-a-boo and pat-a-cake by 12 months of age•    Uses few or no gestures (i.e. waving bye bye) by 12 months of age•    Does not notice when others are upset, by 24 months of age•    Lines up toys or other objects•    Repeats words or actions over and over•    Becomes upset when minor changes occur•    Insists on following certain routines, and becomes upset if these are not followed•    Plays with a toy the same way every time•    Is interested in parts of objects (e.g. wheels on a car)•    Has unusual reactions to sensory experiences (e.g. does not respond to pain; reacts to light touch as if it is painful)•    Has intense interests in a limited number of activities or topics"
    },
    {
        "tag": "p",
        "content": "If you think your child is exhibiting signs of autism, contact your pediatrician and request an autism screening or referral for an autism diagnostic evaluation. OurDevelopmental-Behavioral PediatricsDepartment conducts autism diagnostic evaluations."
    },
    {
        "tag": "p",
        "content": "There are several related conditions that often co-occur with autism, including:"
    },
    {
        "tag": "p",
        "content": "•    Language delay•    Motor delays•    Learning or cognitive delays•    Unusualeatingorsleepinghabits•Hyperactivity or impulsivity•Gastrointestinal issues•Epilepsy or seizures•    Unusual fear reactions (i.e. may not be afraid of real danger, but may be extremely afraid of something that most do not fear)•    Unusual emotional reactions"
    },
    {
        "tag": "p",
        "content": "We don’t know for sure what causes autism, but doctors and scientists believe there can be several different causes.  For some, autism runs in the family, pointing to genetic causes.  Doctors can sometimes also find genetic changes that occur spontaneously, which means they do not come from either parent.  There are some parts of the country where higher rates of autism have been found than what is usually seen.  This has suggested possible environmental causes for some individuals. Sometimes several different causes act together to result in autism.  We often do not know what has caused an individual’s autism."
    },
    {
        "tag": "p",
        "content": "There are many different treatments for autism. Most of them treat the symptoms of autism. We know that people with autism have the best outcomes when we start treatment as early as possible."
    }
]