[
    {
        "text": "OverviewMore than 30% of families in Connecticut have difficulty affording a sufficient supply of diapers for their children. Diaper need affects a family’s ability to go to work and school and threatens the health of a family by increasing the likelihood of maternal depression, parental stress, and diaper rash in infants and children.In response to this need, the Connecticut Hospital Association (CHA) is partnering with the Diaper Bank of Connecticut to address diaper insecurity and diaper need through a new statewide program called Diaper Connections. The partners will work together to develop and implement diaper distribution models that leverage existing local community assets and partnerships. Models can include partnering with community organizations to organize distribution channels, and distributing diapers in hospital settings such as labor and delivery units, maternity and pediatric clinics, emergency departments and primary care sites."
    },
    {
        "text": "Screening for Diaper NeedHospitals, healthcare providers, and community organizations can screen for diaper need with twoquestions:For postpartum individuals and other caregivers of children 3 and under:If you have a child in diapers, do you ever feel that you do not have enough diapers to change yourchild as often as you would like?YesNoNot applicable (I do not have a child in diapers)For pregnant individuals:Are you worried that when you have your baby you may have trouble paying for enough diapers tochange your baby as often as you would like?YesNoI don’t knowHospitals can track diaper need and distribution of diapers by embedding the diaper screening questions in the electronic health record, using a closed-loop technology platform that screens for other social risk and needs, or through other electronic databases and systems that may already be in use. Additionally, hospitals can assess diaper need through their Community Health Needs Assessments, as well as plan distribution programming through their Community Health Improvement Plans."
    },
    {
        "text": "Who is eligible to receive diapers provided by the partnership?The funding, which is available through the Community Development Block Grant and administered through the Connecticut Department of Housing, uses 80% or less of area median income as a guideline for eligibility. For each family receiving diapers, the Diaper Bank of Connecticut, per the Department of Housing requirement, will collect one self-reported application with information on the family’s basic household demographics.Individuals determined to be in economic need and/or those receiving or qualifying for the following services will be automatically eligible for this initiative:Medicaid/HuskySupplemental Nutrition Assistance Program (SNAP)Temporary Assistance for Needy Families (TANF)Temporary Family Assistance Program (TFA)Women, Infants and Children SupplementalNutrition Program (WIC)Housing supportChild care assistance"
    }
]