[
    {
        "block_content": "How can DDS help me or my family member? Family Supports and Services help people with developmental and intellectual disability and their families. DDS Family Supports and Services include: In-home services Respite services Grants Skill training, behavioral and clinical support Our services promote participation in family and community life. Plans are flexible and individualized to meet your needs. We are here to help in times of crisis or transition.",
        "list_items": [
            "In-home services",
            "Respite services",
            "Grants",
            "Skill training, behavioral and clinical support"
        ]
    },
    {
        "block_content": "What services are offered in the home? In-home services help people who live independently or with their families. Think of DDS as an extension of your family – DDS team members can help you from the comfort of your home. In-home services include: Respite Crisis support Behavioral support Nursing support Educational support Transition coordination",
        "list_items": [
            "Respite",
            "Crisis support",
            "Behavioral support",
            "Nursing support",
            "Educational support",
            "Transition coordination"
        ]
    },
    {
        "block_content": "What are respite services? (DDS) recognizes that you or your family member may need occasional breaks. There are different types of respite services to help, depending on your family’s unique situation. Some services involve planned breaks outside of the home at a local Respite Care Center. Visiting the Respite Centers gives you or your family member a chance to meet new people and participate in activities in a home-like environment. At the same time, it gives families some relief from ongoing caregiver responsibilities. Respite breaks allow family members to go on vacation, attend an event, or spend time with other family members and friends. It's also a chance to catch up on work or relax, knowing their loved one is in a safe environment. More about respite",
        "list_items": []
    },
    {
        "block_content": "What are individual and family grants? If you are eligible for DDS services, Individual and Family Grants are available in cash payments to help pay for extra care that people with disabilities and their families may need. You can use these grants to pay for respite services including: In-home support Behavioral support Nursing, medical, or clinical support Temporary help Crisis support Families can buy anything that helps them care for a family member who lives with them who has a disability. People who live on their own and get no other help from DDS at home may also be eligible for these funds.",
        "list_items": [
            "In-home support",
            "Behavioral support",
            "Nursing, medical, or clinical support",
            "Temporary help",
            "Crisis support"
        ]
    }
]