[
    {
        "tag": "a",
        "content": "",
        "href": ""
    },
    {
        "tag": "h2",
        "content": "What is ASD?"
    },
    {
        "tag": "p",
        "content": "Autism spectrum disorder (ASD) is a neurological and developmental disorder that affects how people interact with others, communicate, learn, and behave. Although autism can be diagnosed at any age, it is described as a “developmental disorder” because symptoms generally appear in the first 2 years of life."
    },
    {
        "tag": "p",
        "content": "According to theDiagnostic and Statistical Manual of Mental Disorders (DSM-5), a guide created by the American Psychiatric Association that health care providers use to diagnose mental disorders, people with ASD often have:"
    },
    {
        "tag": "ul",
        "content": "Difficulty with communication and interaction with other people\nRestricted interests and repetitive behaviors\nSymptoms that affect their ability to function in school, work, and other areas of life"
    },
    {
        "tag": "p",
        "content": "Autism is known as a “spectrum” disorder because there is wide variation in the type and severity of symptoms people experience."
    },
    {
        "tag": "p",
        "content": "People of all genders, races, ethnicities, and economic backgrounds can be diagnosed with ASD. Although ASD can be a lifelong disorder, treatments and services can improve a person’s symptoms and daily functioning. The American Academy of Pediatrics recommends that all children receive screening for autism. Caregivers should talk to their child’s health care provider about ASD screening or evaluation."
    },
    {
        "tag": "h2",
        "content": "What are the signs and symptoms of ASD?"
    },
    {
        "tag": "p",
        "content": "The list below gives some examples of common types of behaviors in people diagnosed with ASD. Not all people with ASD will have all behaviors, but most will have several of the behaviors listed below."
    },
    {
        "tag": "h3",
        "content": "Social communication / interaction behaviors may include:"
    },
    {
        "tag": "ul",
        "content": "Making little or inconsistent eye contact\nAppearing not to look at or listen to people who are talking\nInfrequently sharing interest, emotion, or enjoyment of objects or activities (including infrequent pointing at or showing things to others)\nNot responding or being slow to respond to one’s name or to other verbal bids for attention\nHaving difficulties with the back and forth of conversation\nOften talking at length about a favorite subject without noticing that others are not interested or without giving others a chance to respond\nDisplaying facial expressions, movements, and gestures that do not match what is being said\nHaving an unusual tone of voice that may sound sing-song or flat and robot-like\nHaving trouble understanding another person’s point of view or being unable to predict or understand other people’s actions\nDifficulties adjusting behaviors to social situations\nDifficulties sharing in imaginative play or in making friends"
    },
    {
        "tag": "h3",
        "content": "Restrictive / repetitive behaviors may include:"
    },
    {
        "tag": "ul",
        "content": "Repeating certain behaviors or having unusual behaviors, such as repeating words or phrases (a behavior called echolalia)\nHaving a lasting intense interest in specific topics, such as numbers, details, or facts\nShowing overly focused interests, such as with moving objects or parts of objects\nBecoming upset by slight changes in a routine and having difficulty with transitions\nBeing more sensitive or less sensitive than other people to sensory input, such as light, sound, clothing, or temperature"
    },
    {
        "tag": "p",
        "content": "People with ASD may also experience sleep problems and irritability."
    },
    {
        "tag": "p",
        "content": "People on the autism spectrum also may have many strengths, including:"
    },
    {
        "tag": "ul",
        "content": "Being able to learn things in detail and remember information for long periods of time\nBeing strong visual and auditory learners\nExcelling in math, science, music, or art"
    },
    {
        "tag": "h2",
        "content": "What are the causes and risk factors for ASD?"
    },
    {
        "tag": "p",
        "content": "Researchers don’t know the primary causes of ASD, but studies suggest that a person’s genes can act together with aspects of their environment to affect development in ways that lead to ASD. Some factors that are associated with an increased likelihood of developing ASD include:"
    },
    {
        "tag": "ul",
        "content": "Having a sibling with ASD\nHaving older parents\nHaving certain genetic conditions (such as Down syndrome or Fragile X syndrome)\nHaving a very low birth weight"
    },
    {
        "tag": "h2",
        "content": "How is ASD diagnosed?"
    },
    {
        "tag": "p",
        "content": "Health care providers diagnose ASD by evaluating a person’s behavior and development. ASD can usually be reliably diagnosed by age 2. It is important to seek an evaluation as soon as possible. The earlier ASD is diagnosed, the sooner treatments and services can begin."
    },
    {
        "tag": "h3",
        "content": "Diagnosis in young children"
    },
    {
        "tag": "p",
        "content": "Diagnosis in young children is often a two-stage process."
    },
    {
        "tag": "p",
        "content": "Every child should receive well-child check-ups with a pediatrician or an early childhood health care provider. The American Academy of Pediatrics recommends that all children receive screening for developmental delays at their 9-, 18-, and 24- or 30-month well-child visits, with specific autism screenings at their 18- and 24-month well-child visits. A child may receive additional screening if they have a higher likelihood of ASD or developmental problems. Children with a higher likelihood of ASD include those who have a family member with ASD, show some behaviors that are typical of ASD, have older parents, have certain genetic conditions, or who had a very low birth weight."
    },
    {
        "tag": "p",
        "content": "Considering caregivers’ experiences and concerns is an important part of the screening process for young children. The health care provider may ask questions about the child’s behaviors and evaluate those answers in combination with information from ASD screening tools and clinical observations of the child. Read more aboutscreening instrumentson the Centers for Disease Control and Prevention (CDC) website."
    },
    {
        "tag": "a",
        "content": "screening instruments",
        "href": "https://www.cdc.gov/autism/hcp/diagnosis/screening.html"
    },
    {
        "tag": "p",
        "content": "If a child shows developmental differences in behavior or functioning during this screening process, the health care provider may refer the child for additional evaluation."
    },
    {
        "tag": "p",
        "content": "It is important to accurately detect and diagnose children with ASD as early as possible, as this will shed light on their unique strengths and challenges. Early detection also can help caregivers determine which services, educational programs, and behavioral therapies are most likely to be helpful for their child."
    },
    {
        "tag": "p",
        "content": "A team of health care providers who have experience diagnosing ASD will conduct the diagnostic evaluation. This team may include child neurologists, developmental pediatricians, speech-language pathologists, child psychologists and psychiatrists, educational specialists, and occupational therapists."
    },
    {
        "tag": "p",
        "content": "The diagnostic evaluation is likely to include:"
    },
    {
        "tag": "ul",
        "content": "Medical and neurological examinations\nAssessment of the child’s cognitive abilities\nAssessment of the child’s language abilities\nObservation of the child’s behavior\nAn in-depth conversation with the child’s caregivers about the child’s behavior and development\nAssessment of age-appropriate skills needed to complete daily activities independently, such as eating, dressing, and toileting"
    },
    {
        "tag": "p",
        "content": "Because ASD is a complex disorder that sometimes occurs with other illnesses or learning disorders, the comprehensive evaluation may include:"
    },
    {
        "tag": "ul",
        "content": "Blood tests\nHearing test"
    },
    {
        "tag": "p",
        "content": "The evaluation may lead to a formal diagnosis and recommendations for treatment."
    },
    {
        "tag": "h3",
        "content": "Diagnosis in older children and adolescents"
    },
    {
        "tag": "p",
        "content": "Caregivers and teachers are often the first to recognize ASD symptoms in older children and adolescents who attend school. The school’s special education team may perform an initial evaluation and then recommend that a child undergo additional evaluation with their primary health care provider or a health care provider who specialize in ASD."
    },
    {
        "tag": "p",
        "content": "A child’s caregivers may talk with these health care providers about their child’s social difficulties, including problems with subtle communication. For example, some children may have problems understanding tone of voice, facial expressions, or body language. Older children and adolescents may have trouble understanding figures of speech, humor, or sarcasm. They also may have trouble forming friendships with peers."
    },
    {
        "tag": "h3",
        "content": "Diagnosis in adults"
    },
    {
        "tag": "p",
        "content": "Diagnosing ASD in adults is often more difficult than diagnosing ASD in children. In adults, some ASD symptoms can overlap with symptoms of other mental health disorders, such as anxiety disorder or attention-deficit/hyperactivity disorder (ADHD)."
    },
    {
        "tag": "p",
        "content": "Adults who notice signs of ASD should talk with a health care provider and ask for a referral for an ASD evaluation. Although evaluation for ASD in adults is still being refined, adults may be referred to a neuropsychologist, psychologist, or psychiatrist who has experience with ASD. The expert will ask about:"
    },
    {
        "tag": "ul",
        "content": "Social interaction and communication challenges\nSensory issues\nRepetitive behaviors\nRestricted interests"
    },
    {
        "tag": "p",
        "content": "The evaluation also may include a conversation with caregivers or other family members to learn about the person’s early developmental history, which can help ensure an accurate diagnosis."
    },
    {
        "tag": "p",
        "content": "Receiving a correct diagnosis of ASD as an adult can help a person understand past challenges, identify personal strengths, and find the right kind of help. Studies are underway to determine the types of services and supports that are most helpful for improving the functioning and community integration of autistic transition-age youth and adults."
    },
    {
        "tag": "h2",
        "content": "What treatment options are available for ASD?"
    },
    {
        "tag": "p",
        "content": "Treatment for ASD should begin as soon as possible after diagnosis. Early treatment for ASD is important as proper care and services can reduce individuals’ difficulties while helping them build on their strengths and learn new skills."
    },
    {
        "tag": "p",
        "content": "People with ASD may face a wide range of issues, which means that there is no single best treatment for ASD. Working closely with a health care provider is an important part of finding the right combination of treatment and services."
    },
    {
        "tag": "h3",
        "content": "Medication"
    },
    {
        "tag": "p",
        "content": "A health care provider may prescribe medication to treat specific symptoms. With medication, a person with ASD may have fewer problems with:"
    },
    {
        "tag": "ul",
        "content": "Irritability\nAggression\nRepetitive behavior\nHyperactivity\nAttention problems\nAnxiety and depression"
    },
    {
        "tag": "p",
        "content": "Read more about the latest medication warnings, patient medication guides, and information on newly approved medications at theFood and Drug Administration (FDA) website."
    },
    {
        "tag": "a",
        "content": "Food and Drug Administration (FDA) website",
        "href": "http://www.fda.gov/drugsatfda"
    },
    {
        "tag": "h3",
        "content": "Behavioral, psychological, and educational interventions"
    },
    {
        "tag": "p",
        "content": "People with ASD may be referred to a health care provider who specializes in providing behavioral, psychological, educational, or skill-building interventions. These programs are often highly structured and intensive, and they may involve caregivers, siblings, and other family members. These programs may help people with ASD:"
    },
    {
        "tag": "ul",
        "content": "Learn social, communication, and language skills\nReduce behaviors that interfere with daily functioning\nIncrease or build upon strengths\nLearn life skills for living independently"
    },
    {
        "tag": "h3",
        "content": "Other resources"
    },
    {
        "tag": "p",
        "content": "Many services, programs, and other resources are available to help people with ASD. Here are some tips for finding these additional services:"
    },
    {
        "tag": "ul",
        "content": "Contact your health care provider, local health department, school, or autism advocacy group to learn about special programs or local resources.\nFind an autism support group. Sharing information and experiences can help people with ASD and their caregivers learn about treatment options and ASD-related programs.\nRecord conversations and meetings with health care providers and teachers. This information may help when it’s time to decide which programs and services are appropriate.\nKeep copies of health care reports and evaluations. This information may help people with ASD qualify for special programs."
    },
    {
        "tag": "h2",
        "content": "How can I find a clinical trial for ASD?"
    },
    {
        "tag": "p",
        "content": "Clinical trials are research studies that look at new ways to prevent, detect, or treat diseases and conditions. The goal of clinical trials is to determine if a new test or treatment works and is safe. Although individuals may benefit from being part of a clinical trial, participants should be aware that the primary purpose of a clinical trial is to gain new scientific knowledge so that others may be better helped in the future."
    },
    {
        "tag": "p",
        "content": "Researchers at NIMH and around the country conduct many studies with patients and healthy volunteers. We have new and better treatment options today because of what clinical trials uncovered years ago. Be part of tomorrow’s medical breakthroughs. Talk to your health care provider about clinical trials, their benefits and risks, and whether one is right for you."
    },
    {
        "tag": "p",
        "content": "To learn more or find a study, visit:"
    },
    {
        "tag": "ul",
        "content": "NIMH’s Clinical Trials webpage: Information about participating in clinical trials\nClinicaltrials.gov: Current Studies on ASD: List of clinical trials funded by the National Institutes of Health (NIH) being conducted across the country"
    },
    {
        "tag": "a",
        "content": "NIMH’s Clinical Trials webpage",
        "href": "/health/trials"
    },
    {
        "tag": "a",
        "content": "Clinicaltrials.gov: Current Studies on ASD",
        "href": "https://clinicaltrials.gov/ct2/results?term=autism&Search=Apply&recrs=b&recrs=a&age_v=&gndr=&type=&rslt=&fund=0"
    },
    {
        "tag": "h2",
        "content": "Where can I learn more about ASD?"
    },
    {
        "tag": "h3",
        "content": "Free brochures and shareable resources"
    },
    {
        "tag": "ul",
        "content": "Autism Spectrum Disorder: This brochure provides information about the symptoms, diagnosis, and treatment of ASD. Also availableen español.\nDigital Shareables on Autism Spectrum Disorder: Help support ASD awareness and education in your community. Use these digital resources, including graphics and messages, to spread the word about ASD."
    },
    {
        "tag": "a",
        "content": "Autism Spectrum Disorder",
        "href": "/health/publications/autism-spectrum-disorder"
    },
    {
        "tag": "a",
        "content": "en español",
        "href": "/health/publications/espanol/trastornos-del-espectro-autista"
    },
    {
        "tag": "a",
        "content": "Digital Shareables on Autism Spectrum Disorder",
        "href": "/get-involved/digital-shareables/shareable-resources-on-autism-spectrum-disorder"
    },
    {
        "tag": "h3",
        "content": "Federal resources"
    },
    {
        "tag": "ul",
        "content": "Eunice Kennedy ShriverNational Institute of Child Health and Human Development\nNational Institute of Neurological Disorders and Stroke\nNational Institute on Deafness and Other Communication Disorders\nCenters for Disease Control and Prevention(CDC)\nInteragency Autism Coordinating Committee\nMedlinePlus(also availableen español)"
    },
    {
        "tag": "a",
        "content": "Eunice Kennedy ShriverNational Institute of Child Health and Human Development",
        "href": "https://www.nichd.nih.gov/health/topics/autism"
    },
    {
        "tag": "a",
        "content": "National Institute of Neurological Disorders and Stroke",
        "href": "https://www.ninds.nih.gov/Disorders/All-Disorders/Autism-Spectrum-Disorder-Information-Page"
    },
    {
        "tag": "a",
        "content": "National Institute on Deafness and Other Communication Disorders",
        "href": "https://www.nidcd.nih.gov/health/autism-spectrum-disorder-communication-problems-children"
    },
    {
        "tag": "a",
        "content": "Centers for Disease Control and Prevention",
        "href": "http://www.cdc.gov/autism"
    },
    {
        "tag": "a",
        "content": "Interagency Autism Coordinating Committee",
        "href": "https://iacc.hhs.gov/"
    },
    {
        "tag": "a",
        "content": "MedlinePlus",
        "href": "https://www.nlm.nih.gov/medlineplus/autismspectrumdisorder.html"
    },
    {
        "tag": "a",
        "content": "en español",
        "href": "https://medlineplus.gov/spanish/autismspectrumdisorder.html"
    },
    {
        "tag": "h3",
        "content": "Research and statistics"
    },
    {
        "tag": "ul",
        "content": "Science News About Autism Spectrum Disorder: This NIMH webpage provides press releases and announcements about ASD.\nResearch Program on Autism Spectrum Disorders: This NIMH program supports research focused on the characterization, pathophysiology, treatment, and outcomes of ASD and related disorders.\nStatistics: Autism Spectrum Disorder: This NIMH webpage provides information on the prevalence of ASD in the U.S.\nData & Statistics on Autism Spectrum Disorder: This CDC webpage provides data, statistics, and tools about prevalence and demographic characteristics of ASD.\nAutism and Developmental Disabilities Monitoring (ADDM) Network: This CDC-funded program collects data to better understand the population of children with ASD.\nBiomarkers Consortium - The Autism Biomarkers Consortium for Clinical Trials (ABC-CT): This Foundation for the National Institutes of Health project seeks to establish biomarkers to improve treatments for children with ASD."
    },
    {
        "tag": "a",
        "content": "Science News About Autism Spectrum Disorder",
        "href": "/news/science-news/science-news-about-autism-spectrum-disorder-asd"
    },
    {
        "tag": "a",
        "content": "Research Program on Autism Spectrum Disorders",
        "href": "/about/organization/dtr/biomarker-and-intervention-development-for-childhood-onset-mental-disorders-branch/research-program-on-autism-spectrum-disorders"
    },
    {
        "tag": "a",
        "content": "Statistics: Autism Spectrum Disorder",
        "href": "/health/statistics/autism-spectrum-disorder-asd"
    },
    {
        "tag": "a",
        "content": "Data & Statistics on Autism Spectrum Disorder",
        "href": "https://www.cdc.gov/autism/data-research/index.html"
    },
    {
        "tag": "a",
        "content": "Autism and Developmental Disabilities Monitoring (ADDM) Network",
        "href": "https://www.cdc.gov/autism/addm-network/"
    },
    {
        "tag": "a",
        "content": "Biomarkers Consortium - The Autism Biomarkers Consortium for Clinical Trials (ABC-CT)",
        "href": "https://fnih.org/our-programs/biomarkers-consortium/autism-biomarkers"
    },
    {
        "tag": "a",
        "content": "",
        "href": "/site-info/policies#part_2717"
    },
    {
        "tag": "p",
        "content": "Last Reviewed:February 2024"
    },
    {
        "tag": "p",
        "content": "Unless otherwise specified, the information on our website and in our publications is in the public domain and may be reused or copied without permission. However, you may not reuse or copy images. Pleasecite the National Institute of Mental Healthas the source.Read our copyright policyto learn more about our guidelines for reusing NIMH content."
    },
    {
        "tag": "a",
        "content": "cite the National Institute of Mental Health",
        "href": "/site-info/citing-nimh-publications-and-webpages"
    },
    {
        "tag": "a",
        "content": "Read our copyright policy",
        "href": "/site-info/policies#part_2718"
    }
]