{
    "source_url": "https://ctserc.org/services",
    "content": "Culturally Responsive PracticeEducational equity demands access to high-quality educational opportunities that support the success of all students. SERC has developed a comprehensive series of programmatic offerings to ensure that education reflects culturally responsive practices and affirms all identities, advancing family and student engagement\r\n\tin the educational process. These efforts fulfill SERC’s statutory obligation to support educational equity and excellence.Services Include:Equity and Excellence in Our SchoolsEquity WalkthroughsProfessional Learning Communities for EquitySchool-Family PartnershipsStudent VoiceYouth Equity for LeadershipSupport for English LearnersSupporting All AbilitiesSERC works collaboratively with school districts, state agencies, and other partners to help build systems of support for individuals with a range of needs and abilities, birth to adult. SERC uses a variety of professional learning models to enhance the capacity of service providers, educators, and families to use strategies and techniques that meet the unique learning goals of every individual. These efforts support Connecticut’s goals under the State Systemic Improvement Plans (SSIP) to meet requirements of the Individuals with Disabilities Education Act (IDEA).Services Include:ADA & 504Addressing Procedural ComplianceAssistive Technology / Accessible Educational Materials (AEM)InclusionAccess to General Education CurriculumTechnology in EducationLeast Restrictive Environment (LRE), Inclusive Systems and SettingsCo-TeachingIndividualized Education Program (IEP) Development, Planning, and FacilitationEd Benefit Review ProcessParaeducatorsPerson-Centered PlanningSecondary TransitionSpecific Learning Disabilities (SLD) / DyslexiaSpeech And LanguageMulti-Tiered Systems of SupportSERC works closely with schools and districts implementing Scientific Research-Based Interventions (SRBI). This includes technical assistance to local education agencies (LEAs) and schools implementing an evidence-based, multi-tiered behavioral framework (MTBF) [e.g., Positive Behavioral Interventions and Supports (PBIS)] for improving behavioral outcomes and learning conditions for all students.Services Include:Comprehensive Behavior / Mental HealthEarly Intervention Project (EIP)Nonviolent Crisis InterventionPositive Behavioral Interventions and Supports (PBIS)Reflective Team ProcessRestorative Justice / Restorative PracticesScientific Research-Based Interventions (SRBI)Curriculum & InstructionSERC, in collaboration with the CT State Department of Education, supports district efforts to align CT Core Standards and curriculum to instructional practices and subsequent performance tasks that demonstrate student achievement. SERC works within schools to ensure access to all of these practices for every child. SERC provides professional learning experiences — from conferences to book groups — as well as resources that support schools and districts regarding curriculum and instruction.Services Include:AssessmentCo-TeachingCT Core StandardsDifferentiated Instruction (DI)Literacy / ReadingMath LiteracyScience LiteracyTechnology / Universal DesignEarly Childhood Care & EducationSERC assists state agencies and early childhood programs in building effective learning environments and programs to support the development of young children. SERC’s professional learning in this area has a strong focus on developmentally appropriate practice, evidence-based practices in early childhood and early childhood special education, and linguistic and cultural diversity. Our customized program is aligned to the CT Office of Early Childhood 2020 Strategic Plan and collaborates and supports Connecticut’s goals under the State Systemic Improvement Plan (SSIP) to meet requirements of the Individuals with Disabilities Education Act (IDEA).Services Include:Developmentally Appropriate PracticeEarly Learning & Development StandardsEquity And Culturally Responsive PedagogyInclusive PracticeSocial-emotional DevelopmentProgram ServicesSERC supports the needs of schools, school districts, and community providers and organizations seeking to inform and build capacity in areas related to education. Our program services team assists in resource development and provides expert planning, facilitation, and communications and media services for events large and small. Our Library team provides access to resources and services, as well as online databases and research guides.Services Include:Event Planning & FacilitationMedia, Recording & TapingMentoring And Coaching For EducatorsWriting & Editing"
}